{
  "status": "success",
  "totalResults": 739,
  "results": [
    {
      "title": "Cate Campbell commits to record-breaking push for Paris 2024 Olympics",
      "link": "https://www.theage.com.au/sport/swimming/cate-campbell-commits-to-record-breaking-push-for-paris-2024-olympics-20220204-p59tw7.html?ref=rss&utm_medium=rss&utm_source=rss_sport",
      "keywords": null,
      "creator": ["Phil Lutton"],
      "video_url": null,
      "description": "The freestyle star will skip the Commonwealth Games but says she will try to become the first Australian swimmer to make a fifth Olympic team at Paris 2024.",
      "content": null,
      "pubDate": "2022-02-04 05:28:05",
      "full_description": "The dream of five is alive for Cate Campbell. The freestyle star will attempt to become the first Australian swimmer to compete at fifth Olympic Games after mapping out a path towards Paris 2024. Campbell was unsure of her future after a successful Olympic in Tokyo, where she claimed bronze in the 100m freestyle and anchored two gold-medal winning relays, but has now committed to a tilt at what would be a record-breaking appearance in the Paris pool. Cate Campbell (front right) celebrates medley relay gold with Emma McKeon, Chelsea Hodges and Kaylee McKeown in Tokyo. Credit: Getty Images Part of that will mean an extended break from competitive swimming, including this year’s Commonwealth Games in August, which shapes as the major meet for the Dolphins now the FINA World Championships set down for May have been cancelled. Instead, Campbell and her partner will embark on a six-month trip around Europe, something she believes will rejuvenate and rekindle her passion for swimming as she tries to fend off the next generation of home-grown sprint stars gunning for her spot on the national team. She kept an open mind after Tokyo and sought counsel from current and retired swimmers about her next move. But the voice telling her to begin the next stage of her life never piped up and the plan was hatched with Swimming Australia high-performance staff, including her new squad coach Damien Jones. “When I got back from Tokyo, it wasn’t clear to me that I was done with swimming. I wanted to take my time and I spoke to a few retired athletes, just around this idea of ‘when do you know’. People say you just know when it’s the right time to give it away… and I didn’t feel like I had that sense of knowing,” Campbell said. “I knew I needed a really big break physically and mentally. I wasn’t disappointed or heartbroken like 2016 but I was very much burned out. It had been a struggle to get to Toyko. “I think I was just plagued with the ‘what could have been?’. The struggle of the extra year hampered me and it probably took away a bit of the joy of swimming. I just don’t feel like I’m ready to close the chapter but it’s not something I want to dive back into right away.” Campbell currently shares the four-Olympic record with fellow Tokyo squad member Emily Seebohm and breaststroke great Leisel Jones. If she did manage to qualify for a fifth Games, it would put her out on her own in Australia, matching the number of US great Michael Phelps and recently retired Italian star Federica Pellegrini. “I had a few questions to answer after Tokyo. Do I want to get back into the pool, what does that look like and how do I get to the next Olympics? I’ve achieved a lot in the sport but my Olympic preparations have never quite been what I would like them to be. Paris is now the ultimate goal,” Campbell said. Campbell is well down the path to a post-racing career and has been working with multi-national services company Deloitte. But if the pain of Rio taught her anything, it’s that time away from the unrelenting grind of training is vital as she heads into the twilight of a career that began as a teenager at Beijing in 2008. “One of the things that goes hand-in-hand with trying to be the best at something is sacrifice. I’ve never resented the sacrifices I’ve made but I feel like if I didn’t take this opportunity to go and travel, I would resent swimming for what it’s made me give up. “I don’t want to be in that spot at the end of my career when I’ve enjoyed swimming so much and it’s given me so much. Ultimately, it’s about the Olympics in 2024 and I want to be emotionally and physically ready.” Campbell will be 32 by the time the Paris meet begins and just making the team will be a challenge given the sprinting depth in Australia. Emma McKeon is the Olympic 50m-100m champion and looks like she will only get faster, while rising stars Mollie O’Callaghan, Meg Harris and the returning Shayna Jack will all be desperate for individual slots. But Campbell said being part of the world-record breaking 4x100m relay team, which has won gold at the past three Games, would be reward enough if it meant a ticket to France. “To be a part of the Australian swim team is always a privilege, so to be part of that is very special to me,” Campbell said. “But they (domestic rivals) are going to make me lift my game, I’m going to have to swim to their standard. But I have a lot of experience, I have little things to improve and if I can keep mixing it with the best, I will. You can’t really come back to the sport, lots have tried with varying degrees of success.”",
      "image_url": null,
      "source_id": "theage",
      "country": ["australia"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Cate Campbell commits to record-breaking push for Paris 2024 Olympics",
      "link": "https://www.smh.com.au/sport/swimming/cate-campbell-commits-to-record-breaking-push-for-paris-2024-olympics-20220204-p59tw7.html?ref=rss&utm_medium=rss&utm_source=rss_sport",
      "keywords": null,
      "creator": ["Phil Lutton"],
      "video_url": null,
      "description": "The freestyle star will skip the Commonwealth Games but says she will try to become the first Australian swimmer to make a fifth Olympic team at Paris 2024.",
      "content": null,
      "pubDate": "2022-02-04 05:28:05",
      "full_description": "The dream of five is alive for Cate Campbell. The freestyle star will attempt to become the first Australian swimmer to compete at fifth Olympic Games after mapping out a path towards Paris 2024. Campbell was unsure of her future after a successful Olympic in Tokyo, where she claimed bronze in the 100m freestyle and anchored two gold-medal winning relays, but has now committed to a tilt at what would be a record-breaking appearance in the Paris pool. Cate Campbell (front right) celebrates medley relay gold with Emma McKeon, Chelsea Hodges and Kaylee McKeown in Tokyo. Credit: Getty Images Part of that will mean an extended break from competitive swimming, including this year’s Commonwealth Games in August, which shapes as the major meet for the Dolphins now the FINA World Championships set down for May have been cancelled. Instead, Campbell and her partner will embark on a six-month trip around Europe, something she believes will rejuvenate and rekindle her passion for swimming as she tries to fend off the next generation of home-grown sprint stars gunning for her spot on the national team. She kept an open mind after Tokyo and sought counsel from current and retired swimmers about her next move. But the voice telling her to begin the next stage of her life never piped up and the plan was hatched with Swimming Australia high-performance staff, including her new squad coach Damien Jones. “When I got back from Tokyo, it wasn’t clear to me that I was done with swimming. I wanted to take my time and I spoke to a few retired athletes, just around this idea of ‘when do you know’. People say you just know when it’s the right time to give it away… and I didn’t feel like I had that sense of knowing,” Campbell said. “I knew I needed a really big break physically and mentally. I wasn’t disappointed or heartbroken like 2016 but I was very much burned out. It had been a struggle to get to Toyko. “I think I was just plagued with the ‘what could have been?’. The struggle of the extra year hampered me and it probably took away a bit of the joy of swimming. I just don’t feel like I’m ready to close the chapter but it’s not something I want to dive back into right away.” Campbell currently shares the four-Olympic record with fellow Tokyo squad member Emily Seebohm and breaststroke great Leisel Jones. If she did manage to qualify for a fifth Games, it would put her out on her own in Australia, matching the number of US great Michael Phelps and recently retired Italian star Federica Pellegrini. “I had a few questions to answer after Tokyo. Do I want to get back into the pool, what does that look like and how do I get to the next Olympics? I’ve achieved a lot in the sport but my Olympic preparations have never quite been what I would like them to be. Paris is now the ultimate goal,” Campbell said. Campbell is well down the path to a post-racing career and has been working with multi-national services company Deloitte. But if the pain of Rio taught her anything, it’s that time away from the unrelenting grind of training is vital as she heads into the twilight of a career that began as a teenager at Beijing in 2008. “One of the things that goes hand-in-hand with trying to be the best at something is sacrifice. I’ve never resented the sacrifices I’ve made but I feel like if I didn’t take this opportunity to go and travel, I would resent swimming for what it’s made me give up. “I don’t want to be in that spot at the end of my career when I’ve enjoyed swimming so much and it’s given me so much. Ultimately, it’s about the Olympics in 2024 and I want to be emotionally and physically ready.” Campbell will be 32 by the time the Paris meet begins and just making the team will be a challenge given the sprinting depth in Australia. Emma McKeon is the Olympic 50m-100m champion and looks like she will only get faster, while rising stars Mollie O’Callaghan, Meg Harris and the returning Shayna Jack will all be desperate for individual slots. But Campbell said being part of the world-record breaking 4x100m relay team, which has won gold at the past three Games, would be reward enough if it meant a ticket to France. “To be a part of the Australian swim team is always a privilege, so to be part of that is very special to me,” Campbell said. “But they (domestic rivals) are going to make me lift my game, I’m going to have to swim to their standard. But I have a lot of experience, I have little things to improve and if I can keep mixing it with the best, I will. You can’t really come back to the sport, lots have tried with varying degrees of success.”",
      "image_url": null,
      "source_id": "smh",
      "country": ["australia"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Chinese sportswear shares jump as Winter Olympics kick off",
      "link": "https://www.malaymail.com/news/money/2022/02/04/chinese-sportswear-shares-jump-as-winter-olympics-kick-off/2039388",
      "keywords": ["li ning", "china sports brands", "anta sports"],
      "creator": null,
      "video_url": null,
      "description": "HONG KONG, Feb 4 — Shares of China's home-grown sports brands such as ANTA Sports jumped more than 5 per cent on Friday as the world's third most valuable sportswear maker is expected to be a big winner from the Beijing Winter Olympics as the...",
      "content": "An installation featuring Bing Dwen Dwen and Shuey Rhon Rhon, mascots of the Beijing 2022 Winter Olympics and Paralympics is pictured, in Beijing, China January 22, 2022. — Reuters pic Follow us on Instagram and subscribe to our Telegram channel for the latest updates. HONG KONG, Feb 4 — Shares of China's home-grown sports brands such as ANTA Sports jumped more than 5 per cent on Friday as the world's third most valuable sportswear maker is expected to be a big winner from the Beijing Winter Olympics as the games kick off.Another likely winner is Li Ning as it also looks to build on the Olympics and a broader trend among mainland consumers to be more health-conscious.Shares of ANTA, an official sportswear partner of the 2022 Beijing Winter Olympics Games and Paralympics Winter Games, rose as much as 5.2 per cent to HK$122.60 (RM66), their highest since Jan. 25 and set for the biggest daily percentage gain since Jan. 20.ANTA also owns brands such as Fila, Salomon and Descente.Smaller rival Li Ning jumped as much as 6.6 per cent to HK$80.35, the highest since Jan. 26, and set for the biggest daily percentage rise since Nov. 3.\"The Winter Olympics is a new stimulus for China's sports brands and ANTA and Li Ning, as the industry leaders, are set to benefit from a robust prospect for the segment going forward,\" said Linus Yip, chief strategist at First Shanghai Securities.\"Their current valuation, after adjustment, also provides a good entry point for bargain hunting.\"The Beijing Olympics officially opens on Friday, an occasion that Chinese President Xi Jinping said will be streamlined, safe and splendid. — Reuters",
      "pubDate": "2022-02-04 05:24:26",
      "full_description": null,
      "image_url": null,
      "source_id": "malaymail",
      "country": ["singapore", "malaysia"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Filling in for Messing, Sadovsky has Canada in eighth in Olympic team event",
      "link": "https://www.richmond-news.com/beijing-2022-winter-olympics/filling-in-for-messing-sadovsky-has-canada-in-eighth-in-olympic-team-event-5027139",
      "keywords": null,
      "creator": ["Canadian Press"],
      "video_url": null,
      "description": "BEIJING — Hours after learning he would be skating, Roman Sadovsky put Canada in eighth place in the figure skating team event at the Beijing Olympics.",
      "content": null,
      "pubDate": "2022-02-04 05:23:15",
      "full_description": "BEIJING — Hours after learning he would be skating, Roman Sadovsky put Canada in eighth place in the figure skating team event at the Beijing Olympics. The 22-year-old from Toronto had a shaky skate the morning after the Canadian team informed him he'd be stepping in for Canadian champion Keegan Messing, who remains in Canada awaiting a negative COVID-19 test. \"I was told to just stay ready, be prepared,\" Sadovsky said on the late notice. \"All season I’ve been working toward the Olympic Games. I know the Games have a team event. It’s a little bit of an endurance kind of weekend after all the programs. I came here prepared to do anything, really.\" With no room for error in the short program, Sadovsky underrotated and two-footed the landing on his quadruple Salchow to finish with 71.06 points. \"Kind of disappointing honestly,\" Sadovsky said. \"Only because those are mistakes that I don’t usually make. The quad Salchow is a comfort jump for me. It was very successful this season. There was just a slight mishap on the takeoff that didn’t allow me to pull in. \"Definitely your mind races a little bit (after an early mistake). Like, right after it happens. But I know from experience that you’ve got to throw that away and really stay present in the moment and that’s what I did after the first jump.\" Canada was tied with Georgia for sixth after two events in the 10-team competition. Ice dancers Piper Gilles, form Toronto, and Paul Poirier, from Unionville, Ont., gave the Canadians some needed points after finishing fourth with their program to an Elton John's \"I Guess That's Why They Call It the Blues.\" The U.S. led the way in the overall standings with wins in the first two events, followed by the Russian team and Italy. Nathan Chen's score of 111.71, just 0.11 shy of the world short-program record held by Japan's Yuzuru Hanyu. Japan's Shoma Uno was second (105.46), while Russia's Mark Kondratiuk was third (95.81). Chen scored 11.00 points for his quad flip, while Sadovsky, by comparison, scored just 4.3 on his quad attempt. Chen's triple-triple combination scored 17.27, compared to 7.20 for the Canadian. In the ice dance, Madison Hubbell and Zachary Donahue of the U.S., finished first with 86.56 points, followed by Russians Victoria Sinitsina and Nikita Katsalapov at 85.05 and Charlene Guignard and Marco Fabbri of Italy at 83.83. Gilles and Poirier finished with 82.72. The pairs program was set for later Friday. A couple hundred fans sat in every other seat, resembling a checkerboard, in a section of the Capital Indoor Stadium. They politely clapped during the programs — cheering isn't permitted due to COVID-19 safety restrictions. The teams have their own rinkside booths to cheer on teammates, and rather than await scores in the traditional \"kiss and cry,\" skaters rejoin their teammates when they've skated. Sadovsky, the Canadian silver medallist last month behind Messing, hasn't been told whether Messing might arrive in time for Sunday's men's free program — countries are allowed to substitute skaters between the long and short program. But Sadovsky, who's making his Olympic debut, said he's preparing as if he'll skate. \"I haven’t really been in touch with (Messing),\" he said \"We’re not that close to be honest. Nothing against him, we’re just not the closest. We haven’t been in touch and I don’t know the status.\" The men's singles individual event begins with the short program on Tuesday. The women's short program is also Sunday. Medals will be awarded on Monday after the free programs for pairs, ice dance and women. The team event — which features one entry per country in each of the four disciplines — was added to the Olympic program in 2014 in Sochi, where Canada captured silver. A Canadian team led by ice dance stars Tessa Virtue and Scott Moir won gold four years ago in Pyeongchang. This report by The Canadian Press was first published Feb. 3, 2022. Lori Ewing, The Canadian Press",
      "image_url": null,
      "source_id": "richmond-news",
      "country": ["canada"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Chinese sportswear shares jump as Winter Olympics kick off",
      "link": "https://www.channelnewsasia.com/business/chinese-sportswear-shares-jump-winter-olympics-kick-2479166",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": null,
      "content": null,
      "pubDate": "2022-02-04 05:17:45",
      "full_description": null,
      "image_url": null,
      "source_id": "channelnewsasia",
      "country": ["singapore"],
      "category": ["business"],
      "language": "english"
    },
    {
      "title": "Filling in for Messing, Sadovsky has Canada in eighth in Olympic team event",
      "link": "https://www.ctvnews.ca/sports/filling-in-for-messing-sadovsky-has-canada-in-eighth-in-olympic-team-event-1.5767562",
      "keywords": null,
      "creator": ["The Canadian Press"],
      "video_url": null,
      "description": "Hours after learning he would be skating, Roman Sadovsky put Canada in eighth place in the figure skating team event at the Beijing Olympics.",
      "content": null,
      "pubDate": "2022-02-04 05:01:51",
      "full_description": null,
      "image_url": "https://www.ctvnews.ca/polopoly_fs/1.5767563.1643950752!/httpImage/image.jpg_gen/derivatives/landscape_800/image.jpg",
      "source_id": "ctvnews",
      "country": ["canada"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "What sports are included in the Beijing Winter Olympics 2022?",
      "link": "https://metro.co.uk/2022/02/04/winter-olympics-what-sports-are-included-in-beijing-2022-16043373/",
      "keywords": ["Sport", "Winter Olympics"],
      "creator": ["Andrew Gaudion"],
      "video_url": null,
      "description": "Time to get your skates on.",
      "content": "It is time to grab your skates and brush up on your curling knowledge, as the WInter Olympics is finally here. The 2022 sporting event is underway in China – ahead of the opening ceremony later today (February 4) – as athletes from across the world come together to compete in winter sporting events. Since its inception in 1924, the Winter Olympics has seen a number of events come and go across its nearly 100-year history. But how many winter sports are there at the event, and where are they being held? What sports are included in Beijing 2022? There are a total of 15 sports being staged in the Winter Olympics. The sports fall into three separate categories: Ice events, alpine, skiing and snowboarding, and Nordic events. The Olympic flame on display at the Beijing Olympic Tower (Picture: Hou Yu/China News Service via Getty Images) Here is a breakdown of the sports under each category: Ice events Bobsled – Women’s monobob, two-man, two-man, two woman, four-man Luge – Men’s singles, women’s singles, mixed doubles, mixed team relaySkeleton – Men’s, women’sIce hockey – Men’s, women’s Figure skating – Men’s singles, women’s singles, pairs, team, ice dancing Speed skating Short track speed skating – 500m, 1000m, 1500m, relaysCurling – Men’s, women’s, mixed doubles Mixed doubles curling events have already been held (Picture: Jean Catuffe/Getty Images) Alpine, skiing and snowboarding events Alpine skiing – Downhill, super-G, giant slalom, super-combined, mixed team Freestyle skiing – Aerials, moguls, ski cross, ski halfpipe, ski slopestyle Snowboarding – Parallel giant slalom, halfpipe, snowboard cross, big air, slopestyle Nordic events Biathlon – Individual, sprint, pursuit, mass start, relay events Cross-country skiing – Individual sprint, team sprint, freestyle, pursuit, classical, relaysSki jumpingNordic combined {\"@context\":\"https:\\/\\/schema.org\",\"@type\":\"VideoObject\",\"name\":\"Metro.co.uk\",\"duration\":\"T1M38S\",\"thumbnailUrl\":\"https:\\/\\/i.dailymail.co.uk\\/1s\\/2022\\/01\\/31\\/13\\/53585013-0-image-a-7_1643634348539.jpg\",\"uploadDate\":\"2022-01-31T13:01:38+0000\",\"description\":\"Yanqing welcomes media and athletes who are getting ready for the start of the 2022 Winter Olympics.\",\"contentUrl\":\"https:\\/\\/videos.metro.co.uk\\/video\\/met\\/2022\\/01\\/31\\/2152812001655737568\\/480x270_MP4_2152812001655737568.mp4\",\"height\":270,\"width\":480} To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video Beijing will host most of the ice sports, while venues in Yanqing will host the alpine skiing, bobsled, luge, and skeleton events. The majority of the ski and snowboarding events will be held at venues in the popular ski destination of Zhangjiakou, located 180km northwest of Beijing. MORE : Winter Olympics TV schedule: How to watch and stream Beijing 2022 in the UK MORE : Evidently ageless action hero Jackie Chan greets fans on Great Wall Of China as he takes part in Winter Olympics torch relay Follow Metro across our social channels, on Facebook, Twitter and Instagram Share your views in the comments below",
      "pubDate": "2022-02-04 05:00:00",
      "full_description": "It is time to grab your skates and brush up on your curling knowledge , as the WInter Olympics is finally here. The 2022 sporting event is underway in China – ahead of the opening ceremony later today (February 4) – as athletes from across the world come together to compete in winter sporting events. Since its inception in 1924, the Winter Olympics has seen a number of events come and go across its nearly 100-year history. But how many winter sports are there at the event, and where are they being held? There are a total of 15 sports being staged in the Winter Olympics. The sports fall into three separate categories: Ice events, alpine, skiing and snowboarding, and Nordic events. Here is a breakdown of the sports under each category: To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video Beijing will host most of the ice sports, while venues in Yanqing will host the alpine skiing, bobsled, luge, and skeleton events. The majority of the ski and snowboarding events will be held at venues in the popular ski destination of Zhangjiakou, located 180km northwest of Beijing. MORE : Winter Olympics TV schedule: How to watch and stream Beijing 2022 in the UK MORE : Evidently ageless action hero Jackie Chan greets fans on Great Wall Of China as he takes part in Winter Olympics torch relay Follow Metro across our social channels, on Facebook , Twitter and Instagram Share your views in the comments below",
      "image_url": "https://metro.co.uk/wp-content/uploads/2022/02/beijing-2022-sports.png",
      "source_id": "metro",
      "country": ["united kingdom"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "British athlete says China should not host Olympics over rights record",
      "link": "https://www.malaymail.com/news/sports/2022/02/04/british-athlete-says-china-should-not-host-olympics-over-rights-record/2039381",
      "keywords": ["beijing winter olympics"],
      "creator": null,
      "video_url": null,
      "description": "BEIJING, Feb 4 ― A British silver medallist and a prominent US coach at the Beijing Winter Olympics have criticised the decision to award the Games to China over its human rights record. The Games officially open today but the lead-up has been...",
      "content": "The Games officially open today but the lead-up has been overshadowed by concerns about rights in China, especially the fate of the Muslim Uighur minority. — Reuters pic Follow us on Instagram and subscribe to our Telegram channel for the latest updates. BEIJING, Feb 4 ― A British silver medallist and a prominent US coach at the Beijing Winter Olympics have criticised the decision to award the Games to China over its human rights record.The Games officially open today but the lead-up has been overshadowed by concerns about rights in China, especially the fate of the Muslim Uighur minority.The United States is leading a diplomatic boycott of the Olympics in the Chinese capital over what it calls genocide and crimes against humanity in the region of Xinjiang. China denies the accusations.Chinese authorities last month warned competitors against criticising the Beijing government, but British freestyle skier Gus Kenworthy ― who won silver at the 2014 Sochi Games while competing for the United States ― said he would not be silenced.“In my opinion I don't think any country should be allowed to host the Games if they have appalling human rights stances,” he told the BBC ahead of the Beijing Olympics.The 30-year-old added: “I know the Olympics are so important to China and they are always so high up in the medal count, that I feel like by actually taking a stance against them in a real tangible way you could probably make some positive change.“But it's all about money, it seems like. I don't really think they're well suited to host the Games.”Speaking in Beijing, American figure-skating coach and former Olympian Adam Rippon said he hopes the Games will bring added scrutiny on the host country.“What I hope with these Games is that there is so much attention brought to these issues about human rights it does put pressure on the Chinese government to really address it,” the 32-year-old, a team bronze medallist at the 2018 Winter Games, told CNN.“Because when you think about it, why should you award the Games to a country that has these things going on?” ― AFP",
      "pubDate": "2022-02-04 04:53:53",
      "full_description": null,
      "image_url": null,
      "source_id": "malaymail",
      "country": ["singapore", "malaysia"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Skier questions China's Games suitability",
      "link": "https://thewest.com.au/sport/olympics/skier-questions-chinas-games-suitability-c-5567555",
      "keywords": null,
      "creator": ["AAP"],
      "video_url": null,
      "description": "British skier Gus Kenworthy has questioned whether China should be hosting the Winter Olympics, citing human rights concerns.",
      "content": null,
      "pubDate": "2022-02-04 04:48:30",
      "full_description": "British freestyle skier Gus Kenworthy has urged the IOC not to allow countries that have \"appalling human rights stances\" to host the Olympics. He has also questioned China's suitability to stage the 2022 Winter Games. Rights groups have long criticised the IOC for awarding the February 4-20 Games to China. They have cited its treatment of Uyghurs and other Muslim minority groups in the western Xinjiang region, which the United States has deemed genocide. China has consistently denied allegations of human rights abuses and said it opposes the \"politicisation\" of sports. Kenworthy, who claimed a silver medal in slopestyle at Sochi in 2014 for the United States before switching allegiance to Britain in 2019, said the IOC had to take a stance to bring about change. \"I don't think any country should be allowed to host the Games if they have appalling human rights stances,\" Kenworthy told the BBC. \"The IOC should take a stance against a lot of these atrocities and stand up for important issues and by not granting those countries the right to host the Games, they could create positive change ... maybe not even letting them compete. \"But it's all about money, it seems like ... I don't really think they're well suited to host the Games.\" The IOC has said human rights will be protected for all Games participants as part of the host contract, but emphasised that it does not have the power or mandate to change laws or interfere with a sovereign state. The 30-year-old finished 12th in the halfpipe at the last Olympics and will compete in Beijing. Kenworthy said he would continue to protest in Beijing by speaking up for what he believes.",
      "image_url": "https://images.thewest.com.au/publication/C-5567555/7bf4c1dcae4458b2de5cd9515675f7fd4c9dee22-16x9-x0y0w1280h720.jpg",
      "source_id": "thewest",
      "country": ["australia"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Skier questions China's Games suitability",
      "link": "https://www.perthnow.com.au/sport/olympics/skier-questions-chinas-games-suitability-c-5567550",
      "keywords": null,
      "creator": ["AAP"],
      "video_url": null,
      "description": "British skier Gus Kenworthy has questioned whether China should be hosting the Winter Olympics, citing human rights concerns.",
      "content": null,
      "pubDate": "2022-02-04 04:48:29",
      "full_description": "British freestyle skier Gus Kenworthy has urged the IOC not to allow countries that have \"appalling human rights stances\" to host the Olympics. He has also questioned China's suitability to stage the 2022 Winter Games. Rights groups have long criticised the IOC for awarding the February 4-20 Games to China. They have cited its treatment of Uyghurs and other Muslim minority groups in the western Xinjiang region, which the United States has deemed genocide. China has consistently denied allegations of human rights abuses and said it opposes the \"politicisation\" of sports. Kenworthy, who claimed a silver medal in slopestyle at Sochi in 2014 for the United States before switching allegiance to Britain in 2019, said the IOC had to take a stance to bring about change. \"I don't think any country should be allowed to host the Games if they have appalling human rights stances,\" Kenworthy told the BBC. \"The IOC should take a stance against a lot of these atrocities and stand up for important issues and by not granting those countries the right to host the Games, they could create positive change ... maybe not even letting them compete. \"But it's all about money, it seems like ... I don't really think they're well suited to host the Games.\" The IOC has said human rights will be protected for all Games participants as part of the host contract, but emphasised that it does not have the power or mandate to change laws or interfere with a sovereign state. The 30-year-old finished 12th in the halfpipe at the last Olympics and will compete in Beijing. Kenworthy said he would continue to protest in Beijing by speaking up for what he believes.",
      "image_url": "https://images.perthnow.com.au/publication/C-5567550/7bf4c1dcae4458b2de5cd9515675f7fd4c9dee22-16x9-x0y0w1280h720.jpg",
      "source_id": "perthnow",
      "country": ["australia"],
      "category": ["sports"],
      "language": "english"
    }
  ],
  "nextPage": 1
}
