{
  "status": "success",
  "totalResults": 70,
  "results": [
    {
      "title": "Budget 2022 \"Thoughtful\" Policy Agenda For India: IMF Managing Director",
      "link": "https://www.ndtv.com/business/budget-2022-thoughtful-policy-agenda-for-india-imf-managing-director-2748302",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The Union budget presented by Finance Minister Nirmala Sitharaman is a very \"thoughtful\" policy agenda for India and puts a great deal of emphasis on innovation in research and development on human...",
      "content": null,
      "pubDate": "2022-02-04 04:32:30",
      "full_description": "\"We have been projecting a quite robust growth for India,\" IMF's Kristalina Georgieva said. The Union budget presented by Finance Minister Nirmala Sitharaman is a very \"thoughtful\" policy agenda for India and puts a great deal of emphasis on innovation in research and development on human capital investment and digitalisation, Managing Director of IMF Kristalina Georgieva has said. Finance Minister Sitharaman unveiled a Rs 39.45 lakh crore Budget on Tuesday, with higher spending on highways to affordable housing with a view to fire up the key engines of the economy to sustain a world-beating recovery from the pandemic. In the budget, she gave stress on spending on infrastructure to create jobs and boost economic activity. The budget for the fiscal year beginning April 2022 proposed a massive 35 per cent jump in capital expenditure to Rs 7.5 lakh crore, coupled with the rationalisation of customs duty, an extension of time for setting up new manufacturing companies and plans for starting a digital currency and tax crypto assets. \"We have been projecting a quite robust growth for India. Yes, there is a small downgrade versus our previous projection from 9.5 per cent to 9 per cent for 2022. But then we also have a small upgrade for 2023, because we think that we will see a stable growth not very different from (those projected by) the (Union) Minister of Finance,” Georgieva said during a virtual round table with a group of reporters on Thursday. The International Monetary Fund (IMF) sees this being conditioned on a number of factors, including that in the Covid-19 pandemic they continue to function better and should the pandemic continue to be around, and that the tightening of financial conditions would be done with clear forward guidance and in a prudent manner, not creating any more significant shock, she said. \"So far, by the way, what we see is that the tightening of financial conditions is not translating into a big problem for emerging markets. In comparison to previous periods, the impact on rates is not at all significant. Why? Because emerging markets have worked to build buffers and strength for situations like this and because many of them themselves have taken prudent actions once they faced inflationary pressures,” she said. \"We are very positive on the fact that India is thinking of addressing short-term issues, but also long-term structural transformation, and that there is a great deal of emphasis placed on innovation in research and development on human capital investment and digitalisation, as well as thinking of how India can accelerate the climate change agenda using economic instruments for that,” Georgieva said. \"So, all in all, I read the (budget) statement and I thought it was a very thoughtful policy agenda for India,” the lMF MD said in response to a question. The Centre on Tuesday increased the budgetary allocation for the Union Environment Ministry from the last fiscal by 5.6 per cent but shrunk the allocation to control pollution by Rs 10 crore. The government, however, increased the Budget for National Mission for Green India from Rs 290 crore in the last financial year to Rs 361.69 crore this year with the national afforestation programme alone being allotted Rs 300 crore, more than last year's amount of Rs 235 crore. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
      "image_url": "https://c.ndtvimg.com/2020-04/5isujo44_kristalina-georgieva-reuters_120x90_13_April_20.jpg",
      "source_id": "ndtv",
      "country": ["india"],
      "category": ["business"],
      "language": "english"
    },
    {
      "title": "Letters to the Editor: CM's laudable initiative",
      "link": "https://www.sentinelassam.com/editorial/letters-to-the-editor-cms-laudable-initiative-576351",
      "keywords": ["Editorial,More"],
      "creator": ["Sentinel Digital Desk"],
      "video_url": null,
      "description": "We have learnt that the Chief Minister of Assam, while launching the Project Sadbhavana, said that he wants the Government to be sympathetic and empathetic to the citizens and the public. This, indeed, is laudable.",
      "content": "CM's laudable initiative We have learnt that the Chief Minister of Assam, while launching the Project Sadbhavana, said that he wants the Government to be sympathetic and empathetic to the citizens and the public. This, indeed, is laudable. Amongst various arms of the Government, the important ones are health & hygiene, public distribution system, the police, various offices in sub-divisions/villages/blocks/District Magistrate, etc., as also the judicial system. It is suggested that an autonomous body be formed at Central level as well as in the districts and in the hinterland to monitor and suggest ways so that citizen-friendly initiatives are implemented. This should not just be a grievance redressal mechanism, but more of a pro-active body with focus solely for the benefit of the citizens. For this, the body has to be independent so that it can act on its own. D Bhutia, Zoo Road, Guwahati. Do we consider mental struggle? When it comes to the word 'struggle', we always imagine a picture of how someone is dealing with his financial issues how someone overcomes a serious disease or how someone reaches a goal from the zero point etc. We always discuss the seen things. But do we ever think about the mental or emotional struggle that a person carries silently? Mostly, no. A person can be financially stable and physically fit, but still, he or she can be fighting with their trauma, anxiety, disorder etc. A person may be struggling hard to overcome the war inside him. The outcry, the anguish always reverberates in silence. The increasing cases of suicide turn into a horrible issue nowadays. Condemning a person who commits suicide doesn't solve the problem, rather people must find out why these cases are increasing. The major factor behind suicide is people cannot open up themselves or they don't find a safe environment to vent out their suffocation. The constant conflict inside someone results in the inability to adapt or to adjust to circumstances and it creates a permanent and major problem in one's mind. People lose control over their own life. There are many psychological victims and passive sufferers around us who are carrying giant volcanoes inside. If observed minutely, we'll see they fail to express their suppressed thoughts properly and later on get lost in the emotional baggage they carry in their lifetime. As easy as it is to talk about physical illness, it is not so easy to talk about our mental health in our society. Going to a psychiatrist is still a focus of rumours for many people in our society. When asked if we are well, even at the time of suffering from mental trauma or stress, we simply say \"I am fine\". After absorbing pain, disturbance, anxiety, pressure, a person starts losing mental balance at a time. The instability gradually turns into illness and people lose their balance when they get several mental injuries. In our simple language, they become 'insane'. It's so painful to see them still being mocked and rumoured by some of us in society. In a complex social matrix, the emotional or mental condition of a human being is now tragic and frustrated behind the mask. Sometimes it is absurd. The mental struggle should be brought out to light for a healthy life. Society should be supportive and normal if someone is fighting with any trauma, conflict or disorder. People need a wide environment to unlock their inner self as well as the help of mental health specialists. Mamani Das, Uzanbazar, Guwahati.The Kakochang Waterfall On January 6, we left for a family picnic at Kakochang Waterfall, one of the famous top ten picnic spots of Assam located between Bokaghat and Kaziranga National Park in Karbi Anglong, to celebrate the New Year. Our blissful journey started around 6:20 am by bus. We were altogether 24 members. Most of us were children. We wanted to give them a treat on the eve of the New Year. It was an educational tour for them as well. Our bus turned left at Bokajan and moved to the picnic spot through a hilly-and-serpentine road amidst a tea garden. We reached the spot within two-and-a-half hours. My previous visit took more than three-and-a-half hours to cover the not-less-than 100-km distance from Bokajan due to the worst condition of the National Highway. It is needless to say that the road is well furnished. From the entry gate, innovative and beautification measures taken up by the Tourism Department drew my attention. As soon as I found myself in a beautiful place surrounded by hills, I was fascinated by the greenery. \"Hills are blue when they are away.\" This saying doesn't hold good in this case. Still now, the hills are blue and beautiful. The alarming population growth is responsible for deforestation everywhere, leading to ecological imbalance. The dramatic change I have noticed is that Kakochang is also experiencing the impact of deforestation. Sooner forest and tourism departments look into the matter, the better to preserve and protect the incredible beauty of the sanctuary will be. We discovered a suitable place for the New Year feast near the newly constructed Mass Dining Set under the Tourism Department by the CEM, KAAC. From Diphu, the distance of the waterfall is approximately three kilometres. Earlier, the trek was more dangerous, not accessible to children, senior citizens and differently-abled people. Now the road is in good condition. Earlier, one had wade through seven streams to reach the magnificent waterfall. All the streams have their origin from the waterfall itself. In 2018, we enjoyed the barefooted journey. There is a footbridge over every stream. Hence the journey is less hazardous now. Everybody can easily go to the waterfall to enjoy and explore its beauty. With no time to waste, out of ecstasy, I, along with some of my friends, headed to the waterfall. I fell in love with the splendour and vibrant beauty of the wonderful gift of nature. Nature has given us more than we seek. Visitors were clicking selfies. Their joy knew no bounds. I also melted into the crowd and took many selfies with my better half, son and friends. We spent an hour there and got back to our picnic tent. On either side en route to the waterfall, I spotted many makeshift small vendors selling potato chips, kurkure, fresh pineapple pieces in disposable plastic glass and pork in 'bah chunga' (bamboo with hollow inside), the most delicious traditional dish for pork lovers in the Northeast. The environment-friendly measures are praiseworthy. Two or three women were continuously conducting cleanliness drives and collecting the discarded plastic materials for disposal. Two young boys were flushing out the sanitary toilets after every use. It is a hygienic initiative by NRL. The place has water supply facilities. I asked one of the Pan Shop owners about the rush of the picnic parties. He told me that people throng the place from November to January. I think the newly explored popular picnic spot will keep flooded with tourists throughout the year from far and wide shortly. If authorities encourage foreign tourists to the Kaziranga National Park to explore the waterfall, it will boost the economy. A textiles shop also drew the attention of the visitors to a great extent. We enjoyed it to the fullest. Before leaving the place by 4 pm or so, I remembered Robert Frost's poem \"The woods are lovely, dark and deep. But I have promises to keep, And miles to go before I sleep, And miles to go before I sleep.\" Bhubaneswar Dey, Bokajan. Age of digital currency The Government, while presenting the Union Budget, announced the arrival of 'digital rupee' in the next fiscal year. To be introduced with the objective of attaining a more efficient currency management system, the digital rupee will be issued by RBI using blockchain technology. Being one of the most awaited announcements, the digital rupee is likely to have a host of benefits if properly introduced. Firstly, the cost of printing and transporting physical currency will eventually come down with more people shifting towards digital currency. Secondly, with the digital rupee, the scope for counterfeiting will be almost negligible. Thirdly, the traceability of money will increase and its anonymity will decrease. It shall be much easier to ascertain whether the money is reaching the intended beneficiary or not. Owing to the same reason, incidents of tax evasion are also likely to come down. Moreover, the digital rupee can be so programmed so as to control its allocation towards development of various sectors. In a nutshell, it can be concluded that the introduction of digital rupee is truly a right step in the path towards realizing the goal of digital India. Manish Kumar Chowdhury, Bamunimaidam, Guwahati. SC notice to Centre and Election Commission Thanks to the Supreme Court for issuing notice to the Union government and the Election Commission of India, expressing serious concern over the vicious practice of political parties announcing freebie offers in their election manifestos. The culture of freebies practised and perfected by various political parties in India, feigning as 'populist schemes', has indoctrinated the voters and has affected a well-rounded welfarist ideology. Dole-outs are nothing short of bribes, and a government has no imperium to create private assets out of public funds. Free distribution of goods is not a substitute for a truer welfare model that seeks to achieve growth through enhancing productive resources in the economy. Conventional wisdom dictates that unbridled populism and widespread corruption are not only endemic to politics but are antithetical to economic growth and human development. States in India need higher per capita income, and not higher per capita usage of free goods and services. And, we need politicians and political parties to view us as 'citizens' and not just as 'voters', willing to reward those who offer maximum 'muft' schemes. Ranganathan Sivakumar, Madipakkam, Chennai. Rahul speaks in Parliament It is a welcome step that Rahul Gandhi participated in the debate in Parliament and expressed his views on various issues. India has matured as a democracy and the Opposition has a very important role. It is a well known fact that for any Opposition unity, Congress should be at the forefront and the other parties should follow Congress. From 2014 TINA (There Is No Alternative) factor is in existence and to break this factor all Opposition parties should present a united face. Otherwise, the same will happen as happened in 2014 and 2019 when Congress could not win 55 seats to get the status of Leader of the Opposition in the Lok Sabha. Congress is the ruling party in Punjab, Chattisgarh and Rajasthan, and in Maharashtra and Jharkhand it is in coalition with other parties. It is a sorry state of affairs that off and on reports of dissidence are being seen. The party should set its house right and curb activities of dissidence. The group of dissidents which is also known as G23 should be consulted to avoid any further loss to the party. Recently, a star campaigner from UP defected to the BJP, which will further dent the prospects of the party. In UP the party is already very weak and it has to do a lot of work to revive the party. Due to indiscipline in the party it had to change the Chief Minister in Punjab and is now facing a tough election battle in Punjab as AAP is putting up a good fight in the State. To prepare for the 2024 General Elections, the party should complete the inner-party elections from grass-root level and raise the national issues strongly in the Parliament as well as at other platforms as Rahul Gandhi did in Parliament. It is expected that the country will listen to such type of debates in future too, which will strengthen democracy in the country. Yash Pal Ralhan, Jalandhar-144003.",
      "pubDate": "2022-02-04 03:31:20",
      "full_description": "CM's laudable initiative We have learnt that the Chief Minister of Assam, while launching the Project Sadbhavana, said that he wants the Government to be sympathetic and empathetic to the citizens and the public. This, indeed, is laudable. Amongst various arms of the Government, the important ones are health & hygiene, public distribution system, the police, various offices in sub-divisions/villages/blocks/District Magistrate, etc., as also the judicial system. It is suggested that an autonomous body be formed at Central level as well as in the districts and in the hinterland to monitor and suggest ways so that citizen-friendly initiatives are implemented. This should not just be a grievance redressal mechanism, but more of a pro-active body with focus solely for the benefit of the citizens. For this, the body has to be independent so that it can act on its own. D Bhutia, Zoo Road, Guwahati. Do we consider mental struggle? When it comes to the word 'struggle', we always imagine a picture of how someone is dealing with his financial issues how someone overcomes a serious disease or how someone reaches a goal from the zero point etc. We always discuss the seen things. But do we ever think about the mental or emotional struggle that a person carries silently? Mostly, no. A person can be financially stable and physically fit, but still, he or she can be fighting with their trauma, anxiety, disorder etc. A person may be struggling hard to overcome the war inside him. The outcry, the anguish always reverberates in silence. The increasing cases of suicide turn into a horrible issue nowadays. Condemning a person who commits suicide doesn't solve the problem, rather people must find out why these cases are increasing. The major factor behind suicide is people cannot open up themselves or they don't find a safe environment to vent out their suffocation. The constant conflict inside someone results in the inability to adapt or to adjust to circumstances and it creates a permanent and major problem in one's mind. People lose control over their own life. There are many psychological victims and passive sufferers around us who are carrying giant volcanoes inside. If observed minutely, we'll see they fail to express their suppressed thoughts properly and later on get lost in the emotional baggage they carry in their lifetime. As easy as it is to talk about physical illness, it is not so easy to talk about our mental health in our society. Going to a psychiatrist is still a focus of rumours for many people in our society. When asked if we are well, even at the time of suffering from mental trauma or stress, we simply say \"I am fine\". After absorbing pain, disturbance, anxiety, pressure, a person starts losing mental balance at a time. The instability gradually turns into illness and people lose their balance when they get several mental injuries. In our simple language, they become 'insane'. It's so painful to see them still being mocked and rumoured by some of us in society. In a complex social matrix, the emotional or mental condition of a human being is now tragic and frustrated behind the mask. Sometimes it is absurd. The mental struggle should be brought out to light for a healthy life. Society should be supportive and normal if someone is fighting with any trauma, conflict or disorder. People need a wide environment to unlock their inner self as well as the help of mental health specialists. Mamani Das, Uzanbazar, Guwahati. The Kakochang Waterfall On January 6, we left for a family picnic at Kakochang Waterfall, one of the famous top ten picnic spots of Assam located between Bokaghat and Kaziranga National Park in Karbi Anglong, to celebrate the New Year. Our blissful journey started around 6:20 am by bus. We were altogether 24 members. Most of us were children. We wanted to give them a treat on the eve of the New Year. It was an educational tour for them as well. Our bus turned left at Bokajan and moved to the picnic spot through a hilly-and-serpentine road amidst a tea garden. We reached the spot within two-and-a-half hours. My previous visit took more than three-and-a-half hours to cover the not-less-than 100-km distance from Bokajan due to the worst condition of the National Highway. It is needless to say that the road is well furnished. From the entry gate, innovative and beautification measures taken up by the Tourism Department drew my attention. As soon as I found myself in a beautiful place surrounded by hills, I was fascinated by the greenery. \"Hills are blue when they are away.\" This saying doesn't hold good in this case. Still now, the hills are blue and beautiful. The alarming population growth is responsible for deforestation everywhere, leading to ecological imbalance. The dramatic change I have noticed is that Kakochang is also experiencing the impact of deforestation. Sooner forest and tourism departments look into the matter, the better to preserve and protect the incredible beauty of the sanctuary will be. We discovered a suitable place for the New Year feast near the newly constructed Mass Dining Set under the Tourism Department by the CEM, KAAC. From Diphu, the distance of the waterfall is approximately three kilometres. Earlier, the trek was more dangerous, not accessible to children, senior citizens and differently-abled people. Now the road is in good condition. Earlier, one had wade through seven streams to reach the magnificent waterfall. All the streams have their origin from the waterfall itself. In 2018, we enjoyed the barefooted journey. There is a footbridge over every stream. Hence the journey is less hazardous now. Everybody can easily go to the waterfall to enjoy and explore its beauty. With no time to waste, out of ecstasy, I, along with some of my friends, headed to the waterfall. I fell in love with the splendour and vibrant beauty of the wonderful gift of nature. Nature has given us more than we seek. Visitors were clicking selfies. Their joy knew no bounds. I also melted into the crowd and took many selfies with my better half, son and friends. We spent an hour there and got back to our picnic tent. On either side en route to the waterfall, I spotted many makeshift small vendors selling potato chips, kurkure, fresh pineapple pieces in disposable plastic glass and pork in 'bah chunga' (bamboo with hollow inside), the most delicious traditional dish for pork lovers in the Northeast. The environment-friendly measures are praiseworthy. Two or three women were continuously conducting cleanliness drives and collecting the discarded plastic materials for disposal. Two young boys were flushing out the sanitary toilets after every use. It is a hygienic initiative by NRL. The place has water supply facilities. I asked one of the Pan Shop owners about the rush of the picnic parties. He told me that people throng the place from November to January. I think the newly explored popular picnic spot will keep flooded with tourists throughout the year from far and wide shortly. If authorities encourage foreign tourists to the Kaziranga National Park to explore the waterfall, it will boost the economy. A textiles shop also drew the attention of the visitors to a great extent. We enjoyed it to the fullest. Before leaving the place by 4 pm or so, I remembered Robert Frost's poem \"The woods are lovely, dark and deep. But I have promises to keep, And miles to go before I sleep, And miles to go before I sleep.\" Bhubaneswar Dey, Bokajan. Age of digital currency The Government, while presenting the Union Budget, announced the arrival of 'digital rupee' in the next fiscal year. To be introduced with the objective of attaining a more efficient currency management system, the digital rupee will be issued by RBI using blockchain technology. Being one of the most awaited announcements, the digital rupee is likely to have a host of benefits if properly introduced. Firstly, the cost of printing and transporting physical currency will eventually come down with more people shifting towards digital currency. Secondly, with the digital rupee, the scope for counterfeiting will be almost negligible. Thirdly, the traceability of money will increase and its anonymity will decrease. It shall be much easier to ascertain whether the money is reaching the intended beneficiary or not. Owing to the same reason, incidents of tax evasion are also likely to come down. Moreover, the digital rupee can be so programmed so as to control its allocation towards development of various sectors. In a nutshell, it can be concluded that the introduction of digital rupee is truly a right step in the path towards realizing the goal of digital India. Manish Kumar Chowdhury, Bamunimaidam, Guwahati. SC notice to Centre and Election Commission Thanks to the Supreme Court for issuing notice to the Union government and the Election Commission of India, expressing serious concern over the vicious practice of political parties announcing freebie offers in their election manifestos. The culture of freebies practised and perfected by various political parties in India, feigning as 'populist schemes', has indoctrinated the voters and has affected a well-rounded welfarist ideology. Dole-outs are nothing short of bribes, and a government has no imperium to create private assets out of public funds. Free distribution of goods is not a substitute for a truer welfare model that seeks to achieve growth through enhancing productive resources in the economy. Conventional wisdom dictates that unbridled populism and widespread corruption are not only endemic to politics but are antithetical to economic growth and human development. States in India need higher per capita income, and not higher per capita usage of free goods and services. And, we need politicians and political parties to view us as 'citizens' and not just as 'voters', willing to reward those who offer maximum 'muft' schemes. Ranganathan Sivakumar, Madipakkam, Chennai. Rahul speaks in Parliament It is a welcome step that Rahul Gandhi participated in the debate in Parliament and expressed his views on various issues. India has matured as a democracy and the Opposition has a very important role. It is a well known fact that for any Opposition unity, Congress should be at the forefront and the other parties should follow Congress. From 2014 TINA (There Is No Alternative) factor is in existence and to break this factor all Opposition parties should present a united face. Otherwise, the same will happen as happened in 2014 and 2019 when Congress could not win 55 seats to get the status of Leader of the Opposition in the Lok Sabha. Congress is the ruling party in Punjab, Chattisgarh and Rajasthan, and in Maharashtra and Jharkhand it is in coalition with other parties. It is a sorry state of affairs that off and on reports of dissidence are being seen. The party should set its house right and curb activities of dissidence. The group of dissidents which is also known as G23 should be consulted to avoid any further loss to the party. Recently, a star campaigner from UP defected to the BJP, which will further dent the prospects of the party. In UP the party is already very weak and it has to do a lot of work to revive the party. Due to indiscipline in the party it had to change the Chief Minister in Punjab and is now facing a tough election battle in Punjab as AAP is putting up a good fight in the State. To prepare for the 2024 General Elections, the party should complete the inner-party elections from grass-root level and raise the national issues strongly in the Parliament as well as at other platforms as Rahul Gandhi did in Parliament. It is expected that the country will listen to such type of debates in future too, which will strengthen democracy in the country. Yash Pal Ralhan, Jalandhar-144003.",
      "image_url": "https://assets.sentinelassam.com/h-upload/2022/02/03/500x300_307289-lte.jpg",
      "source_id": "sentinel",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Process for 2022-23 state Budget starts",
      "link": "https://www.sentinelassam.com/topheadlines/process-for-2022-23-state-budget-starts-576345",
      "keywords": ["Top Headlines"],
      "creator": ["Sentinel Digital Desk"],
      "video_url": null,
      "description": "The state budget for fiscal 2022-23 is under process now as the Finance Department has issued necessary instructions to various departments.",
      "content": "STAFF REPORTERGUWAHATI: The state budget for fiscal 2022-23 is under process now as the Finance Department has issued necessary instructions to various departments. Ajanta Neog, the first lady Finance Minister of the state, will present her first full-fledged budget in electronic mode during the forthcoming budget session of the Assam Assembly. After the Chief Himanta Biswa Sarma-led government came to power in May 2021, Neog did present the budget for six months of fiscal 2021-22. The Finance Department has instructed various departments to cut unproductive revenue expenditures while preparing their respective budgetary estimates for fiscal 2022-23. It has also asked the departments to submit their implementation status of budgetary announcements of fiscal 2020-21 and up to December 31, 2021, of fiscal 2021-22. The Finance department has spelt out that the departments cannot spend more than 25 per cent of the total budgetary allocations in the last quarter of the financial year. The Finance Department has set February 5, 2022 deadline for the departments to submit their respective budget estimates. After getting the expenditure status of the last fiscals (2020-21 and up to December 31 of 2021-22) of various departments, the Finance Minister will review the department-wise expenditure of budgetary allocations of the previous financial years. She will start the preparations for the 2022-23 Budget soon, but not before getting the nod from the Chief Minister. The Governor summoned the Budget session of the State Assembly from March 14, 2022. Also Read:  CM Himanta Biswa Sarma happy with Union BudgetAlso watch:",
      "pubDate": "2022-02-04 03:21:42",
      "full_description": "STAFF REPORTER GUWAHATI: The state budget for fiscal 2022-23 is under process now as the Finance Department has issued necessary instructions to various departments. Ajanta Neog, the first lady Finance Minister of the state, will present her first full-fledged budget in electronic mode during the forthcoming budget session of the Assam Assembly. After the Chief Himanta Biswa Sarma-led government came to power in May 2021, Neog did present the budget for six months of fiscal 2021-22. The Finance Department has instructed various departments to cut unproductive revenue expenditures while preparing their respective budgetary estimates for fiscal 2022-23. It has also asked the departments to submit their implementation status of budgetary announcements of fiscal 2020-21 and up to December 31, 2021, of fiscal 2021-22. The Finance department has spelt out that the departments cannot spend more than 25 per cent of the total budgetary allocations in the last quarter of the financial year. The Finance Department has set February 5, 2022 deadline for the departments to submit their respective budget estimates. After getting the expenditure status of the last fiscals (2020-21 and up to December 31 of 2021-22) of various departments, the Finance Minister will review the department-wise expenditure of budgetary allocations of the previous financial years. She will start the preparations for the 2022-23 Budget soon, but not before getting the nod from the Chief Minister. The Governor summoned the Budget session of the State Assembly from March 14, 2022. Also Read: CM Himanta Biswa Sarma happy with Union Budget Also watch:",
      "image_url": "https://assets.sentinelassam.com/h-upload/2022/02/04/500x300_307295-ajanta.jpg",
      "source_id": "sentinel",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Budget 2022-23 thoughtful policy agenda for India, says IMF Managing Director Kristalina Georgieva",
      "link": "https://www.indiatvnews.com/business/news/union-budget-2022-thoughtful-policy-agenda-for-india-imf-managing-director-kristalina-georgieva-latest-budget-news-nirmala-sitharaman-2022-02-04-757930",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The Union budget presented by Finance Minister Nirmala Sitharaman recently is a very “thoughtful policy agenda” for India, International Monetary Fund, Managing Director, Kristalina Georgieva said.",
      "content": null,
      "pubDate": "2022-02-04 02:58:10",
      "full_description": "The Union budget presented by Finance Minister Nirmala Sitharaman recently is a very “thoughtful policy agenda” for India, International Monetary Fund, Managing Director, Kristalina Georgieva said. “We have been projecting a quite robust growth for India. Yes, there is a small downgrade versus our previous projection from 9.5 per cent to 9 per cent for 2022. But then we also have a small upgrade for 2023, because we think that we will see a stable growth not very different from (those projected by) the (Union) Minister of Finance,” Georgieva said during a virtual round table with a group of reporters. The International Monetary Fund (IMF), she noted, sees this being conditioned on a number of factors, including that in the COVID-19 pandemic they continue to function better and should the pandemic continue to be around, and that the tightening of financial conditions would be done with clear forward guidance and in a prudent manner, not creating any more significant shock. “So far, by the way, what we see is that the tightening of financial conditions is not translating into a big problem for emerging markets. In comparison to previous periods, the impact on rates is not at all significant. Why? Because emerging markets have worked to build buffers and strength for situations like this and because many of them themselves have taken prudent actions once they faced inflationary pressures,” she said. “We are very positive on the fact that India is thinking of addressing short-term issues, but also long-term structural transformation, and that there is a great deal of emphasis placed on innovation on research and development on human capital investment and digitalisation, as well as thinking of how India can accelerate the climate change agenda using economic instruments for that,” Georgieva said. “So, all in all, I read the (budget) statement and I thought it was a very thoughtful policy agenda for India,” the senior official said in response to a question.",
      "image_url": null,
      "source_id": "indiatvnews",
      "country": ["india"],
      "category": ["business"],
      "language": "english"
    },
    {
      "title": "Jagan silent on injustice to A.P. in Union Budget: Sailajanath",
      "link": "https://www.thehindu.com/news/national/andhra-pradesh/jagan-silent-on-injustice-to-ap-in-union-budget-sailajanath/article38374885.ece",
      "keywords": null,
      "creator": ["The Hindu Bureau"],
      "video_url": null,
      "description": "‘BJP bent on pursuing its Hindutva ideology’",
      "content": null,
      "pubDate": "2022-02-04 02:36:00",
      "full_description": null,
      "image_url": null,
      "source_id": "thehindu",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Corrections and Clarifications",
      "link": "https://www.thehindu.com/opinion/Readers-Editor/corrections-and-clarifications/corrections-and-clarifications/article38372628.ece",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "In the story about industry experts welcoming the boost given to the mental healthcare sector in the Union Budget (Feb. 2, 2022), the reference to Ind",
      "content": null,
      "pubDate": "2022-02-03 17:34:14",
      "full_description": null,
      "image_url": null,
      "source_id": "thehindu",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "India will not make any crypto asset a legal tender: Finance Secretary",
      "link": "https://www.thenewsminute.com/article/india-will-not-make-any-crypto-asset-legal-tender-finance-secretary-160571",
      "keywords": null,
      "creator": ["AzeefaF"],
      "video_url": null,
      "description": "FinanceIndia is working on a legislation to regulate cryptocurrencies, but no draft has yet been released publiclyPTIPixabay | Representative ImageCryptocurrency will never be a legal tender, Finance Secretary TV Somanathan said on Thursday, February 3, clearing the air on the legality of private digital currencies in the market. The 2022-23 Union Budget has given a clarity on taxation of virtual digital assets and proposed to impose a 30% tax on gains made on such trades, besides subjecting crypto transactions beyond a threshold to 1% TDS (Tax Deducted at Source). In an interview with PTI, Somanathan said that just like gold and diamond, despite being valuable, are not a legal tender, private cryptocurrencies too will never be a legal tender. \"Crypto will never be a legal tender. Legal tender means by law it is accepted in settlement of debts. India will not be making any crypto asset as a legal tender. Only 'Digital Rupee' of the Reserve Bank will be a legal tender in India,\" Somanathan said. Except El Salvador, which in September last year adopted Bitcoin as legal tender, no other country has made crypto a legal tender. India is working on legislation to regulate cryptocurrencies, but no draft has yet been released publicly. Meanwhile, a central bank-backed digital currency will start circulating in the next fiscal to usher in cheaper, more efficient currency management. From April 1, 30% tax will have to be paid on income from cryptocurrencies. Income tax return form from next year will have a separate column to declare gains from crypto. Asked why the government has not listed private crypto regulation Bill for the ongoing Budget session, despite listing it in the previous winter session in December, Somanathan said, \"It was felt that wider consultation is necessary before the legislation is brought on what should be the nature of regulation; should there be a regulation or should it be only taxation\". The government had listed for introduction, the 'Cryptocurrency and Regulation of Official Digital Currency Bill' for regulating cryptocurrencies in the previous session of Parliament. The Bill comes amid concerns over such currencies being allegedly used for luring investors with misleading claims. Currently, there is no regulation or any ban on use of cryptocurrencies in the country. \"We are in a democracy. In a democracy, the government starts with something but then there is feedback. Government is listening to that feedback, based on that feedback they are yet to come to a final conclusion on how it should be done. Meanwhile, the questions of tax clarity cannot wait forever because volumes have become very large,\" Somanathan said. He further said that regulation of cryptocurrencies will have to take into account the international consensus since there would be cross-border transactions. \"Some international elements will have to be tied up to make the regulation effective. All those consultations are on,\" the finance secretary said. The crypto market in India grew 641% in the year through June 2021, according to an October report by industry research firm Chainalysis. As the country keeps pace with the global move towards virtual financial instruments, the Union Budget has also announced that India's central bank will launch 'digital rupee' in the next fiscal.",
      "content": null,
      "pubDate": "2022-02-03 13:45:01",
      "image_url": null,
      "source_id": "thenewsminute",
      "country": ["india"],
      "category": ["business"],
      "language": "english"
    },
    {
      "title": "Rakesh Tikait picks holes in Union Budget, says farmers are not getting MSP",
      "link": "https://www.indiatoday.in/india/story/rakesh-tikait-union-budget-farmers-msp-1908309-2022-02-03?utm_source=rss",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Rakesh Tikait picks holes in Union Budget, says farmers are not getting MSP",
      "content": null,
      "pubDate": "2022-02-03 10:22:57",
      "full_description": "Farmer leader Rakesh Tikait has pointed out discrepancies in the Union Budget 2022 and alleged that farmers were not getting the Minimum Support Price (MSP). He said farmers had expectations from the budget and urged voters to raise the issue. He said, \"Farmers had high hopes from the budget and expected to get the benefits. In UP and Uttarakhand, we will distribute pamphlets. We will ask the voters of both the states to question government representatives during the poll campaign.\" He also said payments to sugarcane farmers were delayed instead of the government's assurance. He said, \"PM Modi promised sugarcane payments in 14 days. PM Modi was made to lie. Instead of 14 days, sugarcane payments are being made in 11 months. UP has an issue of sugarcane farmers not being paid. The farmers of Haryana and Uttarakhand are facing similar issues. No one is being paid as per the MSP,\" he said. Urging voters to question candidates, he said, \"We request the voters that they must question those who come seeking votes because no one comes to meet the people unless it is election time. They must take their issues to their respective representatives in their own language.\" Swaraj India president Yogendra Yadav also hit out at the government and said the Union Budget was an attempt to take revenge on the farmers. \"The government is egoistic, and that's why such a budget has been introduced. The farmers' income has not been doubled despite the BJP being in power for over seven years now,\" he said. \"The amount allocated to farmers and farming is nothing but the amount which was supposed to be paid to the farmers for their produce. The budget allocation of farmers has been actually reduced,\" he said.",
      "image_url": null,
      "source_id": "indiatoday",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Ministry of Cooperation gets Rs 900 crore in Union Budget 2022-23",
      "link": "https://www.sentinelassam.com/business/ministry-of-cooperation-gets-rs-900-crore-in-union-budget-2022-23-576272",
      "keywords": ["Business,More"],
      "creator": ["Sentinel Digital Desk"],
      "video_url": null,
      "description": "The Union Budget has allocated Rs 900 crore to the Ministry of Cooperation compared to the revised estimate of Rs 403.30 crore in the current fiscal.",
      "content": "NEW DELHI: The Union Budget has allocated Rs 900 crore to the Ministry of Cooperation compared to the revised estimate of Rs 403.30 crore in the current fiscal.The Ministry was allocated Rs 373 crore in the revised estimate of the 2021-22 while Rs 30.30 crore was given for the National Council for Co-Operative Training (NCCT) which has been increased to Rs 39 crore in 2022-23. Earlier Rs 373 crore was allocated under Central Sector Integrated Scheme on Agriculture Cooperation (CSISAC) but it has been reduced to Rs 50 crore in the FY23. The govenrment has allocated Rs 11 crore to Vaikunth Mehta National Institute of Cooperative Management (VAMNICOM). For the first time, a separate Budget has been provided to VAMNICOM. It is envisaged to convert it into a full fledged independent institution with its own budgetary allocation. Earlier its budgetary requirements are met through the Grants-in-aid released to NCCT. Similarly, Rs 10.90 crore has been allocated to the Central Registrar of Cooperative Societies while one crore has got one crore for Cooperation Credit Guarantee Fund. The Budget has also made a provision of Rs 30 crore for Cooperative education whereas Rs 25 crore has been given for Cooperative Training. The government has also announced the reduction of Minimum Alternate Tax on Cooperative Societies from 18.5 per cent to 15 per cent while an announcement was made to reduce the surcharge on Cooperatives Societies from 12 per cent to 7 per cent having income between Rs. 1 to 10 crores. An amount of Rs 350 crore has been provided for digitisation of Primary Agriculture Cooperative Societies. The scheme aims to computerize 63000 PACS leading to increase in efficiency, profitability, transparency & accountability in the working of PACS. Similarly, a total of Rs 274 crore has been provided for an Umbrella Scheme \"Prosperity through Cooperatives\" which would have a number of subcomponents with the aim of all round development of cooperatives in the country. (IANS) Also Read:  Budget to create new opportunities: PM Narendra ModiAlso watch:",
      "pubDate": "2022-02-03 07:35:27",
      "full_description": "NEW DELHI: The Union Budget has allocated Rs 900 crore to the Ministry of Cooperation compared to the revised estimate of Rs 403.30 crore in the current fiscal. The Ministry was allocated Rs 373 crore in the revised estimate of the 2021-22 while Rs 30.30 crore was given for the National Council for Co-Operative Training (NCCT) which has been increased to Rs 39 crore in 2022-23. Earlier Rs 373 crore was allocated under Central Sector Integrated Scheme on Agriculture Cooperation (CSISAC) but it has been reduced to Rs 50 crore in the FY23. The govenrment has allocated Rs 11 crore to Vaikunth Mehta National Institute of Cooperative Management (VAMNICOM). For the first time, a separate Budget has been provided to VAMNICOM. It is envisaged to convert it into a full fledged independent institution with its own budgetary allocation. Earlier its budgetary requirements are met through the Grants-in-aid released to NCCT. Similarly, Rs 10.90 crore has been allocated to the Central Registrar of Cooperative Societies while one crore has got one crore for Cooperation Credit Guarantee Fund. The Budget has also made a provision of Rs 30 crore for Cooperative education whereas Rs 25 crore has been given for Cooperative Training. The government has also announced the reduction of Minimum Alternate Tax on Cooperative Societies from 18.5 per cent to 15 per cent while an announcement was made to reduce the surcharge on Cooperatives Societies from 12 per cent to 7 per cent having income between Rs. 1 to 10 crores. An amount of Rs 350 crore has been provided for digitisation of Primary Agriculture Cooperative Societies. The scheme aims to computerize 63000 PACS leading to increase in efficiency, profitability, transparency & accountability in the working of PACS. Similarly, a total of Rs 274 crore has been provided for an Umbrella Scheme \"Prosperity through Cooperatives\" which would have a number of subcomponents with the aim of all round development of cooperatives in the country. (IANS) Also Read: Budget to create new opportunities: PM Narendra Modi Also watch:",
      "image_url": "https://assets.sentinelassam.com/h-upload/2022/02/03/307034-nirma.jpg",
      "source_id": "sentinel",
      "country": ["india"],
      "category": ["business"],
      "language": "english"
    },
    {
      "title": "Fiscal Push: Budget FY23, value buying lift equity indices",
      "link": "https://www.sentinelassam.com/business/fiscal-push-budget-fy23-value-buying-lift-equity-indices-576257",
      "keywords": ["Business,More"],
      "creator": ["Sentinel Digital Desk"],
      "video_url": null,
      "description": "Stock buying sentiment triggered by Union Budget as well as attractive valuations lifted India’s key equity indices — S&P BSE Sensex and NSE Nifty50 — on Wednesday.",
      "content": "MUMBAI: Stock buying sentiment triggered by Union Budget as well as attractive valuations lifted India's key equity indices — S&P BSE Sensex and NSE Nifty50 — on Wednesday. Initially, the domestic equity market opened higher and remained in the green without any major correction. Globally, shares rose in Europe on Wednesday as investor sentiment continued to steady after a rout last month.Amongst sectors Realty, Consumer Durables, Banks, IT and healthcare indices rose the most. Consequently, the Sensex closed at 59,558.33 points, up by 695.76 points or 1.18 per cent. Similarly, Nifty made gains during the day's trade session. It rose by 203.15 points or 1.16 per cent to 17,780 points. \"After three consecutive days of gains, Nifty could consolidate or correct a bit over the next few days,\" said Deepak Jasani, Head of Retail Research, HDFC Securities. According to Vijay Dhanotiya, Category Lead- HNI Products at CapitalVia Global Research: \"We witnessed market extended the gain further after the decisive breach of Nifty 50 Index level of 17,600. Our research suggests the market is likely to hold the momentum and reach the level of 18,000.\" \"We expect the 17,550-17,600 level to act as a support zone from the short-term perspective.\" (IANS) Also Read:  Profit booking, global cues subdue equity indices; IT stocks fallAlso watch:",
      "pubDate": "2022-02-03 07:16:50",
      "full_description": "MUMBAI: Stock buying sentiment triggered by Union Budget as well as attractive valuations lifted India's key equity indices — S&P BSE Sensex and NSE Nifty50 — on Wednesday. Initially, the domestic equity market opened higher and remained in the green without any major correction. Globally, shares rose in Europe on Wednesday as investor sentiment continued to steady after a rout last month. Amongst sectors Realty, Consumer Durables, Banks, IT and healthcare indices rose the most. Consequently, the Sensex closed at 59,558.33 points, up by 695.76 points or 1.18 per cent. Similarly, Nifty made gains during the day's trade session. It rose by 203.15 points or 1.16 per cent to 17,780 points. \"After three consecutive days of gains, Nifty could consolidate or correct a bit over the next few days,\" said Deepak Jasani, Head of Retail Research, HDFC Securities. According to Vijay Dhanotiya, Category Lead- HNI Products at CapitalVia Global Research: \"We witnessed market extended the gain further after the decisive breach of Nifty 50 Index level of 17,600. Our research suggests the market is likely to hold the momentum and reach the level of 18,000.\" \"We expect the 17,550-17,600 level to act as a support zone from the short-term perspective.\" (IANS) Also Read: Profit booking, global cues subdue equity indices; IT stocks fall Also watch:",
      "image_url": "https://assets.sentinelassam.com/h-upload/2022/02/03/500x300_307009-equi.jpg",
      "source_id": "sentinel",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    }
  ],
  "nextPage": 1
}
